<script>
export default {
  data() {
    return {
      faqs: [
        {
          q: 'イェール大学の一般情報',
          a: 'イェール大学はアイビーリーグのメンバーです。アイビーリーグというのは、アメリカで有名ないくつかの大学です。ここでは80もの専攻から選択できたり、2000もの授業を取ったりできる。人気の専攻は経済と工学と生物学。ここには、6000人くらいの学生がいて、51%は女性、49%は男性です。学生の出身は様々です。ニューヨークか東京かロンドンなどからの出身学生がいる。',
          open: false
        },
        {
          q: 'オールドキャンパス',
          a: 'オールドキャンパスはイェール大学にとってとても伝統的な部分（ぶぶん）です。大体全部の一年生がここに住んでいるので、他の一年生に会いやすいです。１年中イベントがあります。例えばよくコンサートをしたり、冬に雪合戦(ゆきがっせん）をしたりします。洗濯する所があります。アイスクリームのある秘密の地下室もありますよ。オールドキャンパスは古いのに、楽しくて気楽です。',
          open: false
        },
        {
          q: 'クロスキャンパス',
          a: 'これはイェール大学の心臓です。この道には、たくさん図書館と寮と教室があります。春学期になると、ここは綺麗になりすぎます。よくここで大学生達はフリスビーをしたり、草で昼寝したり、犬と遊んだりしているのをよく見ます。じゃ、最初の図書館に行こう！',
          open: false
        },
        {
          q: 'バース図書館',
          a: '図書館はバースと言います。地下にあります。バース図書館というのはイェール大学の20以上の図書館のメンバーです。バースカフェは図書館の地下1階にあって、外国語の練習をしている学生をよく見かけます。ここはとても楽に話せる所で、中でたくさん勉強できる所も見つけられます。',
          open: false
        },
        {
          q: 'スタリング図書館',
          a: 'スタリング図書館は多分イェールの最大で有名な図書館です。この図書館には2000000(二百万)もの本があります。バース図書館よりもっと勉強できる所があります。スタックスというのはスタリングの一番人気の勉強する所です。僕たちのお気に入りの勉強場所は東アジア図書館です。ここでは漫画か中国哲学を読めます！',
          open: false
        },
        {
          q: 'バイネッキプラザ',
          a: 'バイネッキは特別な図書館です。ちょっと美術館みたいで、たくさん文学とか書道とか100年も古い本などがあります。ここに、朝河貫一(あさかわ・かんいち)に書かれた本は700冊もあります。めっちゃきれいです。',
          open: false
        },
        {
          q: '寮',
          a: 'イェール大学の寮制度はとても特殊な制度です。ハリーポッターについて知っていますか?その物語のハウス制度と比べたら、そんなに違いはないです。ここで14棟の寮の建物はそれぞれの寮に自分の特殊(とくしゅ)な文化、図書館、食堂などがあります。イェール大学の新入生は最初の学期を始める前に、寮に割り当てられます。',
          open: false
        },
        {
          q: '寮のお部屋',
          a: '僕達のお部屋はスイートです。ベッドルームとつながったリビングルームがあります。スイートによっては 4名用、6名用、8名用のスイートもあります。色々あるよ!そして、これらのルームメイトは生涯(しょうがい)の友人になるかもしれません。部屋もとても素敵です。イェール大学の学生は2年生まで寮に住まなければなりません。 3年生からは寮に住み続けることも、キャンパス外に転居(てんきょ)することもできます。',
          open: false
        },
        {
          q: '食堂',
          a: 'イェール大学の食堂はビュッフェみたいです。入ってしまえば、好きなだけ食べられます。メニューは毎日違います。時々韓国風(ふう)フライドチキンやインドカレーやポークカツなどもあります。その上、アイスクリーム、ピザ、スープもあります。食べ物はとても美味しいです。新しい人や友達と出会う良い機会なので、私は食堂が大好きです。',
          open: false
        },
        {
          q: 'バッタリ',
          a: '先に言った通り、それぞれの寮は自分のバッタリというカフェみたいな所があります。地下で、平日は午後10時から真夜中まで開いています。その間、働いている大学生はポテトとかチキンナゲットとかジュースなどを料理して売っています。最高の部分はバッタリの安さ。それに、プールテーブルかバスケコートか他のゲームをすることができます。本当につかれた後に、ここに来るのは最高のことです。',
          open: false
        }
      ]
    }
  },
  methods: {
    toggleFAQ(index) {
      this.faqs.forEach((faq, i) => {
        if (i !== index) {
          faq.open = false
        }
      })

      this.faqs[index].open = !this.faqs[index].open
    }
  }
}
</script>
<template>
  <div class="_dropdown_">
    <div v-for="(faq, index) in faqs" :key="index" class="-faqs-x">
      <div @click="toggleFAQ(index)" class="faq-item">
        <h3 class="-q">{{ faq.q }}</h3>
        <div v-if="faq.open" class="-a-x">
          <p class="-a">{{ faq.a }}</p>
        </div>
      </div>
    </div>
  </div>
</template>

<style>
._dropdown_ {
  padding-top: 1rem;
  margin: 0 auto;
  max-width: 992px;
}
.faq-item {
  cursor: pointer;
  padding: 0.5rem;
  transition: 250ms ease;
}
@media (hover: hover) {
  .faq-item:hover {
    color: #fff;
    background-color: var(--y-blue);
  }
}
.-q {
  font-size: 1.5rem;
  font-weight: 400;
  padding: 0.25rem;
}
.-a {
  font-size: 1.25rem;
  font-weight: 300;
  margin-left: 2.25rem;
  padding: 0.125rem;
}
</style>
